tutorials/viscoelastic/viscoelasticFluidFoam/White-Metzner/Carreau-Yasuda/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          viscoelasticProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



rheology
{
    type multiMode;

    models
    (
        first
        {

            type White-Metzner_Carreau-Yasuda;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 3.14e2;
            lambda           lambda [0 0 1 0 0 0 0] 8.7487e-1;
            K                K [0 0 1 0 0 0 0] 6.0362e-1;
            L                L [0 0 1 0 0 0 0] 4.0056e1;
            m                m [0 0 0 0 0 0 0] 1.7314e-1;
            n                n [0 0 0 0 0 0 0] 6.4293e-2;
            a                a [0 0 0 0 0 0 0] 5.5061e-1 ;
            b                b [0 0 0 0 0 0 0] 2.3229e-1;

        }

    );
}


// ************************************************************************* //
